*** crates/vault-client-rs/src/circuit_breaker.rs:100:34: replace >= with < in CircuitBreaker::record_failure

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace >= with < in CircuitBreaker::record_failure
@@ -92,17 +92,17 @@
     /// transitioning to Open
     pub fn record_failure(&self) {
         if let Ok(mut state) = self.state.lock() {
             match *state {
                 State::Closed {
                     consecutive_failures,
                 } => {
                     let new_count = consecutive_failures + 1;
-                    if new_count >= self.config.failure_threshold {
+                    if new_count < /* ~ changed by cargo-mutants ~ */ self.config.failure_threshold {
                         *state = State::Open {
                             since: Instant::now(),
                         };
                     } else {
                         *state = State::Closed {
                             consecutive_failures: new_count,
                         };
                     }


  stderr ───

    thread 'circuit_breaker_test::circuit_opens_after_threshold' (221106) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:39:9:
    expected non-circuit error, got: Circuit breaker is open — Vault appears unreachable
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::success_resets_failure_counter' (221128) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:281:78:
    called `Result::unwrap()` on an `Err` value: CircuitOpen
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::stuck_half_open_probe_self_heals' (221120) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:219:5:
    probe should have been cancelled by the timeout before completing
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.051s] ( 86/552) vault-client-rs::mock circuit_breaker_test::circuit_opens_after_threshold
        FAIL [   0.045s] ( 87/552) vault-client-rs::mock circuit_breaker_test::success_resets_failure_counter
        FAIL [   0.202s] (116/552) vault-client-rs::mock circuit_breaker_test::stuck_half_open_probe_self_heals

*** result: Failure(100)
