*** crates/vault-client-rs/src/circuit_breaker.rs:52:9: replace CircuitBreaker::check -> Result<(), VaultError> with Ok(())

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace CircuitBreaker::check -> Result<(), VaultError> with Ok(())
@@ -44,44 +44,17 @@
                 consecutive_failures: 0,
             }),
         }
     }
 
     /// Returns `Ok(())` if a request may proceed, or
     /// `Err(VaultError::CircuitOpen)` if the circuit is open
     pub fn check(&self) -> Result<(), VaultError> {
-        let mut state = self.state.lock().map_err(|_| VaultError::LockPoisoned)?;
-        match *state {
-            State::Closed { .. } => Ok(()),
-            State::Open { since } => {
-                if since.elapsed() >= self.config.reset_timeout {
-                    *state = State::HalfOpen {
-                        since: Instant::now(),
-                    };
-                    Ok(())
-                } else {
-                    Err(VaultError::CircuitOpen)
-                }
-            }
-            State::HalfOpen { since } => {
-                // Only one probe at a time; subsequent requests while half-open are
-                // rejected until the probe completes. If the probe itself never
-                // resolves (e.g. its future was cancelled before recording a result),
-                // allow a fresh probe after `reset_timeout` instead of staying stuck
-                if since.elapsed() >= self.config.reset_timeout {
-                    *state = State::HalfOpen {
-                        since: Instant::now(),
-                    };
-                    Ok(())
-                } else {
-                    Err(VaultError::CircuitOpen)
-                }
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Record a successful response, resetting the circuit to Closed
     pub fn record_success(&self) {
         if let Ok(mut state) = self.state.lock() {
             *state = State::Closed {
                 consecutive_failures: 0,
             };


  stderr ───

    thread 'circuit_breaker_test::circuit_opens_after_threshold' (137111) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:51:5:
    expected CircuitOpen, got: Vault API error (HTTP 500): internal error
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::circuit_resets_after_timeout' (137110) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:92:5:
    assertion failed: matches!(err, VaultError::CircuitOpen)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::failed_probe_sends_circuit_back_to_open' (137118) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:165:5:
    circuit should be open after failed probe, got: Vault API error (HTTP 500): internal error
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.051s] ( 87/552) vault-client-rs::mock circuit_breaker_test::circuit_opens_after_threshold
        FAIL [   0.051s] ( 89/552) vault-client-rs::mock circuit_breaker_test::circuit_resets_after_timeout
        FAIL [   0.211s] (121/552) vault-client-rs::mock circuit_breaker_test::failed_probe_sends_circuit_back_to_open

*** result: Failure(100)
