*** crates/vault-client-rs/src/circuit_breaker.rs:56:36: replace >= with < in CircuitBreaker::check

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace >= with < in CircuitBreaker::check
@@ -48,17 +48,17 @@
 
     /// Returns `Ok(())` if a request may proceed, or
     /// `Err(VaultError::CircuitOpen)` if the circuit is open
     pub fn check(&self) -> Result<(), VaultError> {
         let mut state = self.state.lock().map_err(|_| VaultError::LockPoisoned)?;
         match *state {
             State::Closed { .. } => Ok(()),
             State::Open { since } => {
-                if since.elapsed() >= self.config.reset_timeout {
+                if since.elapsed() < /* ~ changed by cargo-mutants ~ */ self.config.reset_timeout {
                     *state = State::HalfOpen {
                         since: Instant::now(),
                     };
                     Ok(())
                 } else {
                     Err(VaultError::CircuitOpen)
                 }
             }


  stderr ───

    thread 'circuit_breaker_test::circuit_opens_after_threshold' (149108) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:51:5:
    expected CircuitOpen, got: Vault API error (HTTP 500): internal error
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::circuit_resets_after_timeout' (149111) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:92:5:
    assertion failed: matches!(err, VaultError::CircuitOpen)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::stuck_half_open_probe_self_heals' (149115) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:219:5:
    probe should have been cancelled by the timeout before completing
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.049s] ( 86/552) vault-client-rs::mock circuit_breaker_test::circuit_opens_after_threshold
        FAIL [   0.061s] ( 88/552) vault-client-rs::mock circuit_breaker_test::circuit_resets_after_timeout
        FAIL [   0.215s] (119/552) vault-client-rs::mock circuit_breaker_test::stuck_half_open_probe_self_heals
        FAIL [   0.221s] (120/552) vault-client-rs::mock circuit_breaker_test::failed_probe_sends_circuit_back_to_open

*** result: Failure(100)
