*** crates/vault-client-rs/src/circuit_breaker.rs:70:36: replace >= with < in CircuitBreaker::check

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace >= with < in CircuitBreaker::check
@@ -62,17 +62,17 @@
                     Err(VaultError::CircuitOpen)
                 }
             }
             State::HalfOpen { since } => {
                 // Only one probe at a time; subsequent requests while half-open are
                 // rejected until the probe completes. If the probe itself never
                 // resolves (e.g. its future was cancelled before recording a result),
                 // allow a fresh probe after `reset_timeout` instead of staying stuck
-                if since.elapsed() >= self.config.reset_timeout {
+                if since.elapsed() < /* ~ changed by cargo-mutants ~ */ self.config.reset_timeout {
                     *state = State::HalfOpen {
                         since: Instant::now(),
                     };
                     Ok(())
                 } else {
                     Err(VaultError::CircuitOpen)
                 }
             }


  stderr ───

    thread 'circuit_breaker_test::stuck_half_open_probe_self_heals' (161118) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:238:81:
    called `Result::unwrap()` on an `Err` value: CircuitOpen
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.410s] (151/552) vault-client-rs::mock circuit_breaker_test::stuck_half_open_probe_self_heals

*** result: Failure(100)
