*** crates/vault-client-rs/src/circuit_breaker.rs:84:9: replace CircuitBreaker::record_success with ()

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace CircuitBreaker::record_success with ()
@@ -76,21 +76,17 @@
                     Err(VaultError::CircuitOpen)
                 }
             }
         }
     }
 
     /// Record a successful response, resetting the circuit to Closed
     pub fn record_success(&self) {
-        if let Ok(mut state) = self.state.lock() {
-            *state = State::Closed {
-                consecutive_failures: 0,
-            };
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Record a failure, incrementing the counter and potentially
     /// transitioning to Open
     pub fn record_failure(&self) {
         if let Ok(mut state) = self.state.lock() {
             match *state {
                 State::Closed {


  stderr ───

    thread 'circuit_breaker_test::success_resets_failure_counter' (173116) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:300:9:
    circuit should still be closed
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::circuit_resets_after_timeout' (173109) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:112:82:
    called `Result::unwrap()` on an `Err` value: CircuitOpen
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.058s] ( 88/552) vault-client-rs::mock circuit_breaker_test::success_resets_failure_counter
        FAIL [   0.201s] (112/552) vault-client-rs::mock circuit_breaker_test::circuit_resets_after_timeout

*** result: Failure(100)
