*** crates/vault-client-rs/src/circuit_breaker.rs:99:58: replace + with - in CircuitBreaker::record_failure

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace + with - in CircuitBreaker::record_failure
@@ -91,17 +91,17 @@
     /// Record a failure, incrementing the counter and potentially
     /// transitioning to Open
     pub fn record_failure(&self) {
         if let Ok(mut state) = self.state.lock() {
             match *state {
                 State::Closed {
                     consecutive_failures,
                 } => {
-                    let new_count = consecutive_failures + 1;
+                    let new_count = consecutive_failures - /* ~ changed by cargo-mutants ~ */ 1;
                     if new_count >= self.config.failure_threshold {
                         *state = State::Open {
                             since: Instant::now(),
                         };
                     } else {
                         *state = State::Closed {
                             consecutive_failures: new_count,
                         };


  stderr ───

    thread 'circuit_breaker_test::circuit_opens_after_threshold' (197117) panicked at crates/vault-client-rs/src/circuit_breaker.rs:99:37:
    attempt to subtract with overflow
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::failed_probe_sends_circuit_back_to_open' (197121) panicked at crates/vault-client-rs/src/circuit_breaker.rs:99:37:
    attempt to subtract with overflow
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::circuit_resets_after_timeout' (197120) panicked at crates/vault-client-rs/src/circuit_breaker.rs:99:37:
    attempt to subtract with overflow
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.046s] ( 84/552) vault-client-rs::mock circuit_breaker_test::circuit_opens_after_threshold
        FAIL [   0.046s] ( 88/552) vault-client-rs::mock circuit_breaker_test::failed_probe_sends_circuit_back_to_open
        FAIL [   0.051s] ( 89/552) vault-client-rs::mock circuit_breaker_test::circuit_resets_after_timeout
        FAIL [   0.050s] ( 90/552) vault-client-rs::mock circuit_breaker_test::stuck_half_open_probe_self_heals
        FAIL [   0.049s] ( 91/552) vault-client-rs::mock circuit_breaker_test::success_resets_failure_counter

*** result: Failure(100)
