*** crates/vault-client-rs/src/circuit_breaker.rs:99:58: replace + with * in CircuitBreaker::record_failure

*** mutation diff:
--- crates/vault-client-rs/src/circuit_breaker.rs
+++ replace + with * in CircuitBreaker::record_failure
@@ -91,17 +91,17 @@
     /// Record a failure, incrementing the counter and potentially
     /// transitioning to Open
     pub fn record_failure(&self) {
         if let Ok(mut state) = self.state.lock() {
             match *state {
                 State::Closed {
                     consecutive_failures,
                 } => {
-                    let new_count = consecutive_failures + 1;
+                    let new_count = consecutive_failures * /* ~ changed by cargo-mutants ~ */ 1;
                     if new_count >= self.config.failure_threshold {
                         *state = State::Open {
                             since: Instant::now(),
                         };
                     } else {
                         *state = State::Closed {
                             consecutive_failures: new_count,
                         };


  stderr ───

    thread 'circuit_breaker_test::circuit_resets_after_timeout' (209120) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:92:5:
    assertion failed: matches!(err, VaultError::CircuitOpen)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::circuit_opens_after_threshold' (209119) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:51:5:
    expected CircuitOpen, got: Vault API error (HTTP 500): internal error
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'circuit_breaker_test::failed_probe_sends_circuit_back_to_open' (209123) panicked at crates/vault-client-rs/tests/mock/circuit_breaker_test.rs:165:5:
    circuit should be open after failed probe, got: Vault API error (HTTP 500): internal error
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.050s] ( 87/552) vault-client-rs::mock circuit_breaker_test::circuit_resets_after_timeout
        FAIL [   0.062s] ( 89/552) vault-client-rs::mock circuit_breaker_test::circuit_opens_after_threshold
        FAIL [   0.201s] (119/552) vault-client-rs::mock circuit_breaker_test::failed_probe_sends_circuit_back_to_open

*** result: Failure(100)
