*** crates/vault-client-rs/src/types/error.rs:101:9: replace VaultError::status_code -> Option<u16> with None

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ replace VaultError::status_code -> Option<u16> with None
@@ -93,20 +93,11 @@
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)
     }
 
     #[must_use]
     pub fn status_code(&self) -> Option<u16> {
-        match self {
-            Self::Api { status, .. } => Some(*status),
-            Self::AuthRequired => Some(401),
-            Self::PermissionDenied { .. } => Some(403),
-            Self::NotFound { .. } => Some(404),
-            Self::RateLimited { .. } => Some(429),
-            Self::ConsistencyRetry => Some(412),
-            Self::Sealed { .. } => Some(503),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }


  stderr ───

    thread 'ergonomics_test::sealed_status_code_is_503' (329727) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:110:5:
    assertion `left == right` failed
      left: None
     right: Some(503)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'types_test::prop_status_code_correctness' (333586) panicked at crates/vault-client-rs/tests/unit/types_test.rs:132:1:
    Test failed: assertion failed: `(left == right)` 
      left: `None`,
     right: `Some(400)` at crates/vault-client-rs/tests/unit/types_test.rs:153.
    minimal failing input: status = 400
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'types_test::status_code_for_dedicated_variants' (333597) panicked at crates/vault-client-rs/tests/unit/types_test.rs:198:5:
    assertion `left == right` failed
      left: None
     right: Some(503)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.005s] (161/552) vault-client-rs::mock ergonomics_test::sealed_status_code_is_503
        FAIL [   0.005s] (534/552) vault-client-rs::unit types_test::prop_status_code_correctness
        FAIL [   0.006s] (542/552) vault-client-rs::unit types_test::status_code_for_dedicated_variants

*** result: Failure(100)
