*** crates/vault-client-rs/src/types/error.rs:105:13: delete match arm Self::NotFound{..} in VaultError::status_code

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ delete match arm Self::NotFound{..} in VaultError::status_code
@@ -97,16 +97,16 @@
     }
 
     #[must_use]
     pub fn status_code(&self) -> Option<u16> {
         match self {
             Self::Api { status, .. } => Some(*status),
             Self::AuthRequired => Some(401),
             Self::PermissionDenied { .. } => Some(403),
-            Self::NotFound { .. } => Some(404),
+             /* ~ changed by cargo-mutants ~ */
             Self::RateLimited { .. } => Some(429),
             Self::ConsistencyRetry => Some(412),
             Self::Sealed { .. } => Some(503),
             _ => None,
         }
     }
 }


  stderr ───

    thread 'types_test::status_code_for_dedicated_variants' (405941) panicked at crates/vault-client-rs/tests/unit/types_test.rs:210:5:
    assertion `left == right` failed
      left: None
     right: Some(404)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.005s] (540/552) vault-client-rs::unit types_test::status_code_for_dedicated_variants

*** result: Failure(100)
