*** crates/vault-client-rs/src/types/error.rs:108:13: delete match arm Self::Sealed{..} in VaultError::status_code

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ delete match arm Self::Sealed{..} in VaultError::status_code
@@ -100,13 +100,13 @@
     pub fn status_code(&self) -> Option<u16> {
         match self {
             Self::Api { status, .. } => Some(*status),
             Self::AuthRequired => Some(401),
             Self::PermissionDenied { .. } => Some(403),
             Self::NotFound { .. } => Some(404),
             Self::RateLimited { .. } => Some(429),
             Self::ConsistencyRetry => Some(412),
-            Self::Sealed { .. } => Some(503),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 }


  stderr ───

    thread 'ergonomics_test::sealed_status_code_is_503' (437774) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:110:5:
    assertion `left == right` failed
      left: None
     right: Some(503)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'types_test::status_code_for_dedicated_variants' (441473) panicked at crates/vault-client-rs/tests/unit/types_test.rs:198:5:
    assertion `left == right` failed
      left: None
     right: Some(503)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.005s] (163/552) vault-client-rs::mock ergonomics_test::sealed_status_code_is_503
        FAIL [   0.005s] (540/552) vault-client-rs::unit types_test::status_code_for_dedicated_variants

*** result: Failure(100)
