*** crates/vault-client-rs/src/types/error.rs:86:9: replace VaultError::is_retryable -> bool with false

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ replace VaultError::is_retryable -> bool with false
@@ -78,22 +78,17 @@
     fn from(err: ParseFloatError) -> Self {
         Self::Config(format!("float parse error: {err}"))
     }
 }
 
 impl VaultError {
     #[must_use]
     pub fn is_retryable(&self) -> bool {
-        match self {
-            Self::Http(e) => e.is_timeout() || e.is_connect(),
-            Self::Sealed { .. } | Self::RateLimited { .. } | Self::ConsistencyRetry => true,
-            Self::Api { status, .. } => matches!(status, 500 | 502 | 503 | 504),
-            _ => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)
     }
 
     #[must_use]


  stderr ───

    thread 'client_test::server_500_retried_then_succeeds' (245342) panicked at crates/vault-client-rs/tests/mock/client_test.rs:579:48:
    called `Result::unwrap()` on an `Err` value: Api { status: 500, errors: ["internal error"] }
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───
    proptest: Saving this and future failures in /tmp/cargo-mutants-git-source-JRSoMP.tmp/crates/vault-client-rs/tests/proptest-regressions/ergonomics_test.txt
    proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
    cc 96483ed9ec8e7f795af5897eafb8c4f208d6cd3a47834d7c32a90f017123fbfb

    thread 'ergonomics_test::prop_sealed_variant_is_always_marked_retryable' (245679) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:259:1:
    Test failed: assertion failed: err.is_retryable() at crates/vault-client-rs/tests/mock/ergonomics_test.rs:265.
    minimal failing input: url = "aaa://000"
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'ergonomics_test::sealed_is_still_retryable' (245727) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:100:5:
    assertion failed: VaultError::Sealed { url: "http://vault:8200".into() }.is_retryable()
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.033s] (109/552) vault-client-rs::mock client_test::server_500_retried_then_succeeds
        FAIL [   0.005s] (156/552) vault-client-rs::mock ergonomics_test::prop_sealed_variant_is_always_marked_retryable
        FAIL [   0.006s] (163/552) vault-client-rs::mock ergonomics_test::sealed_is_still_retryable
        FAIL [   0.006s] (510/552) vault-client-rs::unit sys_misc_types_test::error_display_and_conversions
        FAIL [   0.005s] (531/552) vault-client-rs::unit types_test::prop_retryable_api_status_codes
        FAIL [   0.005s] (536/552) vault-client-rs::unit types_test::retryable_variants_are_retryable

*** result: Failure(100)
