*** crates/vault-client-rs/src/types/error.rs:89:13: delete match arm Self::Api{status, ..} in VaultError::is_retryable

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ delete match arm Self::Api{status, ..} in VaultError::is_retryable
@@ -81,17 +81,17 @@
 }
 
 impl VaultError {
     #[must_use]
     pub fn is_retryable(&self) -> bool {
         match self {
             Self::Http(e) => e.is_timeout() || e.is_connect(),
             Self::Sealed { .. } | Self::RateLimited { .. } | Self::ConsistencyRetry => true,
-            Self::Api { status, .. } => matches!(status, 500 | 502 | 503 | 504),
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         }
     }
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)
     }


  stderr ───

    thread 'client_test::server_500_retried_then_succeeds' (281342) panicked at crates/vault-client-rs/tests/mock/client_test.rs:579:48:
    called `Result::unwrap()` on an `Err` value: Api { status: 500, errors: ["internal error"] }
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'sys_misc_types_test::error_display_and_conversions' (285460) panicked at crates/vault-client-rs/tests/unit/sys_misc_types_test.rs:538:5:
    assertion failed: VaultError::Api { status: 503, errors: vec![] }.is_retryable()
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'types_test::prop_retryable_api_status_codes' (285544) panicked at crates/vault-client-rs/tests/unit/types_test.rs:132:1:
    Test failed: assertion failed: err.is_retryable() at crates/vault-client-rs/tests/unit/types_test.rs:138.
    minimal failing input: status = 500
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

        FAIL [   0.044s] (108/552) vault-client-rs::mock client_test::server_500_retried_then_succeeds
        FAIL [   0.005s] (508/552) vault-client-rs::unit sys_misc_types_test::error_display_and_conversions
        FAIL [   0.006s] (532/552) vault-client-rs::unit types_test::prop_retryable_api_status_codes

*** result: Failure(100)
