*** crates/vault-client-rs/src/types/error.rs:101:9: replace VaultError::status_code -> Option<u16> with Some(1)

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ replace VaultError::status_code -> Option<u16> with Some(1)
@@ -93,20 +93,11 @@
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)
     }
 
     #[must_use]
     pub fn status_code(&self) -> Option<u16> {
-        match self {
-            Self::Api { status, .. } => Some(*status),
-            Self::AuthRequired => Some(401),
-            Self::PermissionDenied { .. } => Some(403),
-            Self::NotFound { .. } => Some(404),
-            Self::RateLimited { .. } => Some(429),
-            Self::ConsistencyRetry => Some(412),
-            Self::Sealed { .. } => Some(503),
-            _ => None,
-        }
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 }


  stderr ───

    thread 'ergonomics_test::sealed_status_code_is_503' (582538) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:110:5:
    assertion `left == right` failed
      left: Some(1)
     right: Some(503)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'error_http_test::http_transport_error_is_retryable' (586193) panicked at crates/vault-client-rs/tests/unit/error_http_test.rs:31:5:
    assertion `left == right` failed
      left: Some(1)
     right: None
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'types_test::prop_status_code_correctness' (586387) panicked at crates/vault-client-rs/tests/unit/types_test.rs:132:1:
    Test failed: assertion failed: `(left == right)` 
      left: `Some(1)`,
     right: `Some(400)` at crates/vault-client-rs/tests/unit/types_test.rs:153.
    minimal failing input: status = 400
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.005s] (162/553) vault-client-rs::mock ergonomics_test::sealed_status_code_is_503
        FAIL [   0.059s] (503/553) vault-client-rs::unit error_http_test::http_transport_error_is_retryable
        FAIL [   0.006s] (535/553) vault-client-rs::unit types_test::prop_status_code_correctness
        FAIL [   0.005s] (541/553) vault-client-rs::unit types_test::status_code_for_dedicated_variants

*** result: Failure(100)
