*** crates/vault-client-rs/src/types/error.rs:102:13: delete match arm Self::Api{status, ..} in VaultError::status_code

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ delete match arm Self::Api{status, ..} in VaultError::status_code
@@ -94,17 +94,17 @@
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)
     }
 
     #[must_use]
     pub fn status_code(&self) -> Option<u16> {
         match self {
-            Self::Api { status, .. } => Some(*status),
+             /* ~ changed by cargo-mutants ~ */
             Self::AuthRequired => Some(401),
             Self::PermissionDenied { .. } => Some(403),
             Self::NotFound { .. } => Some(404),
             Self::RateLimited { .. } => Some(429),
             Self::ConsistencyRetry => Some(412),
             Self::Sealed { .. } => Some(503),
             _ => None,
         }


  stderr ───

    thread 'types_test::prop_status_code_correctness' (598629) panicked at crates/vault-client-rs/tests/unit/types_test.rs:132:1:
    Test failed: assertion failed: `(left == right)` 
      left: `None`,
     right: `Some(400)` at crates/vault-client-rs/tests/unit/types_test.rs:153.
    minimal failing input: status = 400
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.005s] (536/553) vault-client-rs::unit types_test::prop_status_code_correctness

*** result: Failure(100)
