*** crates/vault-client-rs/src/types/error.rs:107:13: delete match arm Self::ConsistencyRetry in VaultError::status_code

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ delete match arm Self::ConsistencyRetry in VaultError::status_code
@@ -99,14 +99,14 @@
     #[must_use]
     pub fn status_code(&self) -> Option<u16> {
         match self {
             Self::Api { status, .. } => Some(*status),
             Self::AuthRequired => Some(401),
             Self::PermissionDenied { .. } => Some(403),
             Self::NotFound { .. } => Some(404),
             Self::RateLimited { .. } => Some(429),
-            Self::ConsistencyRetry => Some(412),
+             /* ~ changed by cargo-mutants ~ */
             Self::Sealed { .. } => Some(503),
             _ => None,
         }
     }
 }


  stderr ───

    thread 'types_test::status_code_for_dedicated_variants' (658774) panicked at crates/vault-client-rs/tests/unit/types_test.rs:209:5:
    assertion `left == right` failed
      left: None
     right: Some(412)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.005s] (541/553) vault-client-rs::unit types_test::status_code_for_dedicated_variants

*** result: Failure(100)
