*** crates/vault-client-rs/src/types/error.rs:86:9: replace VaultError::is_retryable -> bool with true

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ replace VaultError::is_retryable -> bool with true
@@ -78,22 +78,17 @@
     fn from(err: ParseFloatError) -> Self {
         Self::Config(format!("float parse error: {err}"))
     }
 }
 
 impl VaultError {
     #[must_use]
     pub fn is_retryable(&self) -> bool {
-        match self {
-            Self::Http(e) => e.is_timeout() || e.is_connect(),
-            Self::Sealed { .. } | Self::RateLimited { .. } | Self::ConsistencyRetry => true,
-            Self::Api { status, .. } => matches!(status, 500 | 502 | 503 | 504),
-            _ => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)
     }
 
     #[must_use]


  stderr ───

    thread 'sys_misc_types_test::error_display_and_conversions' (466084) panicked at crates/vault-client-rs/tests/unit/sys_misc_types_test.rs:545:5:
    assertion failed: !VaultError::Api { status: 400, errors: vec![] }.is_retryable()
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'types_test::non_retryable_variants' (466111) panicked at crates/vault-client-rs/tests/unit/types_test.rs:159:5:
    assertion failed: !VaultError::PermissionDenied { errors: vec![] }.is_retryable()
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───
    proptest: Saving this and future failures in /tmp/cargo-mutants-git-source-C25qxO.tmp/crates/vault-client-rs/tests/proptest-regressions/types_test.txt
    proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
    cc 0639bef1a0598f8dc42f8fe5ffed51666b2bfe4f388a1984eaecdcdb221df211

    thread 'types_test::prop_non_retryable_status_codes' (466143) panicked at crates/vault-client-rs/tests/unit/types_test.rs:132:1:
    Test failed: assertion failed: !err.is_retryable() at crates/vault-client-rs/tests/unit/types_test.rs:147.
    minimal failing input: status = 400
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.004s] (511/553) vault-client-rs::unit sys_misc_types_test::error_display_and_conversions
        FAIL [   0.004s] (525/553) vault-client-rs::unit types_test::non_retryable_variants
        FAIL [   0.006s] (533/553) vault-client-rs::unit types_test::prop_non_retryable_status_codes

*** result: Failure(100)
