*** crates/vault-client-rs/src/types/error.rs:87:45: replace || with && in VaultError::is_retryable

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ replace || with && in VaultError::is_retryable
@@ -79,17 +79,17 @@
         Self::Config(format!("float parse error: {err}"))
     }
 }
 
 impl VaultError {
     #[must_use]
     pub fn is_retryable(&self) -> bool {
         match self {
-            Self::Http(e) => e.is_timeout() || e.is_connect(),
+            Self::Http(e) => e.is_timeout() && /* ~ changed by cargo-mutants ~ */ e.is_connect(),
             Self::Sealed { .. } | Self::RateLimited { .. } | Self::ConsistencyRetry => true,
             Self::Api { status, .. } => matches!(status, 500 | 502 | 503 | 504),
             _ => false,
         }
     }
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {


  stderr ───

    thread 'error_http_test::http_transport_error_is_retryable' (526235) panicked at crates/vault-client-rs/tests/unit/error_http_test.rs:26:5:
    a transport-level Http error must be retryable
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

error: test run failed

*** result: Failure(100)

        FAIL [   0.052s] (490/553) vault-client-rs::unit error_http_test::http_transport_error_is_retryable

*** result: Failure(100)
