*** crates/vault-client-rs/src/types/error.rs:88:13: delete match arm Self::Sealed{..} | Self::RateLimited{..} | Self::ConsistencyRetry in VaultError::is_retryable

*** mutation diff:
--- crates/vault-client-rs/src/types/error.rs
+++ delete match arm Self::Sealed{..} | Self::RateLimited{..} | Self::ConsistencyRetry in VaultError::is_retryable
@@ -80,17 +80,17 @@
     }
 }
 
 impl VaultError {
     #[must_use]
     pub fn is_retryable(&self) -> bool {
         match self {
             Self::Http(e) => e.is_timeout() || e.is_connect(),
-            Self::Sealed { .. } | Self::RateLimited { .. } | Self::ConsistencyRetry => true,
+             /* ~ changed by cargo-mutants ~ */
             Self::Api { status, .. } => matches!(status, 500 | 502 | 503 | 504),
             _ => false,
         }
     }
 
     #[must_use]
     pub fn is_auth_error(&self) -> bool {
         matches!(self, Self::PermissionDenied { .. } | Self::AuthRequired)


  stderr ───

    thread 'ergonomics_test::prop_sealed_variant_is_always_marked_retryable' (498351) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:259:1:
    Test failed: assertion failed: err.is_retryable() at crates/vault-client-rs/tests/mock/ergonomics_test.rs:265.
    minimal failing input: url = "aaa://a0."
    successes: 0
    local rejects: 0
    global rejects: 0

    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'ergonomics_test::sealed_is_still_retryable' (498363) panicked at crates/vault-client-rs/tests/mock/ergonomics_test.rs:100:5:
    assertion failed: VaultError::Sealed { url: "http://vault:8200".into() }.is_retryable()
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'sys_misc_types_test::error_display_and_conversions' (501919) panicked at crates/vault-client-rs/tests/unit/sys_misc_types_test.rs:536:5:
    assertion failed: VaultError::ConsistencyRetry.is_retryable()
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.006s] (156/553) vault-client-rs::mock ergonomics_test::prop_sealed_variant_is_always_marked_retryable
        FAIL [   0.006s] (162/553) vault-client-rs::mock ergonomics_test::sealed_is_still_retryable
        FAIL [   0.004s] (510/553) vault-client-rs::unit sys_misc_types_test::error_display_and_conversions
        FAIL [   0.006s] (539/553) vault-client-rs::unit types_test::retryable_variants_are_retryable

*** result: Failure(100)
